//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~1~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~//
/* let celsius = 10;
let fahrenheit = 32;

let toFahrenheit = (celsius * 9/5) + 32;
console.log(`${celsius} по Цельсию равно ${toFahrenheit} по Фаренгейту`);

let toCelsius = (fahrenheit - 32) * 5/9;
console.log(`${fahrenheit} по Фаренгейту равно ${toCelsius} по Цельсию`);*/

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~2~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~//
/*
let a = 5, b = 7, c = 10;

if (a + b > c && a + c > b && b + c > a) {
    console.log("треугольник существует");

    let perimeter = a + b + c;
    console.log(`периметр = ${perimeter}`);

    let s = perimeter / 2;

    let area = Math.sqrt(s * (s - a) * (s - b) * (s - c));
    console.log(`Площадь = ${area}`);

    let ratio = perimeter / area;
    console.log(`Соотношение = ${ratio}`);
} else {
    console.log("треугольника не существует"); 
}*/

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~3~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~//

/*
let num = 500;

for (let i = 0; i <= num; i++) {
    if (i % 5 === 0) {
        console.log(`${i} fizz buzz`);
    } else if (i % 2 === 0) {
        console.log(`${i} buzz`);
    } else {
        console.log(`${i} fizz`);
    }
}
*/

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~4~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~//

/*
let height = 12; 
let tree = "";

for (let i = 1; i <= height; i++) {
    tree += (i % 2 === 0 ? "#".repeat(i) : "*".repeat(i)) + "\n";
}


tree += "||";

console.log(tree);*/

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~5~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~//

/*
let n = 12, x = 2, y = 6;

let isDivisible = (n % x === 0 && n % y === 0);
console.log(`n = ${n}, x = ${x}, y = ${y} => ${isDivisible}`);*/

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~6~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~//

/*
let month = 11; 

let quarter = Math.ceil(month / 3);

console.log(`месяц ${month} => ${quarter} квартал`);
*/

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~7~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~//

/*
let n = 5;
let result = [];

for (let i = 0; i <= n; i++) {
    result.push(2 ** i);
}

console.log(result.join(", "));
*/

/* 1,2,3,4,5,6,7,8,9,10 */
/* ТОЛЬКО ЧЕТНЫЕ */

let num = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
let result = [];

for (let i = 0; i <= num.length; i++) {
  if (i % 2 == 0) {
    result.push(i);
  }
}

console.log(result);
